"""Создать словарь в качестве ключа которого будет 6-ти значное число (id), а в
качестве значений кортеж состоящий из 2-х элементов - имя(str), возраст(int).
Сделать около 5-6 элементов словаря. Записать данный словарь на диск в json-файл."""

import json

auntif = {
    125635: ['Евгений', '18'],
    125785: ['Дмитрий', '85'],
    156235: ['Николай', '42'],
    185445: ['Наталья', '37'],
    133635: ['Екатерина', '29'],
    186425: ['Александра', '33'],
    }

print(auntif)

with open('json_file.json', 'w', encoding='utf=8') as file:
    json.dump(auntif, file, indent=1)

with open('json_file.json', 'r', encoding='utf=8') as file:
    print(file.read())